import { prisma } from "../services/prisma.js"

export async function refMessage(bot, chatId){
    const user = await prisma.users.findFirst({
        where: {chatId}
    })


    return await bot.sendMessage(chatId, `🎉 Реферальная программа SHIELDSURF+  

💡 Как это работает?  
Делитесь своей уникальной реферальной ссылкой:  
🔗 ${user.ref}  
Когда друзья оформляют подписку через неё, вы зарабатываете!  

💰 Условия заработка:  
- 50 рублей за каждого друга, купившего подписку, если у вас есть активная подписка.  
- 25 рублей, если подписки у вас нет.  

💳 На что можно потратить деньги?  
- Вывести их на банковскую карту (если у вас есть активная подписка, купленная за деньги).  
- Оплатить ими свою подписку, если её ещё нет.  

📊 Ваш бонусный счет:  
💸 ${user.refBalance} рублей  

🎯 Преимущества:  
- Быстрый и безопасный доступ к интернету с SHIELDSURF+.  
- Простая настройка и надёжная защита данных.  
- Мы предоставляем вам готовые медиафайлы (баннеры, изображения и текст) для удобного продвижения!  

Делитесь ссылкой и зарабатывайте с SHIELDSURF+ уже сегодня!`)
}