import { onMainKeyboard } from "../keyboards/keyboards.js";

export async function faqMessage(bot, chatId){
    return await bot.sendMessage(chatId, `📌 FAQ – Часто задаваемые вопросы о VPN SHIELDSURF

1️⃣ Насколько стабильно работает SHIELDSURF?

SHIELDSURF обеспечивает высокую скорость и стабильное соединение без перебоев. Наши серверы оптимизированы для максимальной надёжности.

2️⃣ На каких устройствах работает VPN?

SHIELDSURF поддерживает Windows, macOS, Linux, iOS, Android и даже Android TV. Вы сможете подключиться с любого устройства.

3️⃣ Есть ли ограничения по скорости и трафику?

Нет! Мы предоставляем неограниченный трафик и высокую скорость без ограничений по загрузке, включая поддержку торрентов.

4️⃣ Как получить 24 часа бесплатного доступа?

Подпишитесь на наш Telegram-канал, и мы подарим вам сутки бесплатного VPN.

5️⃣ Как связаться с поддержкой?

Наша служба поддержки 24/7 всегда готова помочь. Напишите нам в боте, и мы быстро решим ваш вопрос! 🚀`, onMainKeyboard)
}