export async function vpnMessage(bot, chatId){
    return await bot.sendPhoto(chatId, "./assets/db/images/IMG_5181.JPG", {caption: ` 🛡 Что такое SHIELDSURF?
    
Безопасность данных: Полная анонимность, мы ничего не храним.

Скорость и стабильность: Комфортное соединение без лагов.

Обход блокировок: Доступ ко всем сервисам, даже заблокированным.

Современные технологии: Протокол WireGuard для максимальной скорости и защиты.

Поддержка устройств: Windows, macOS, iOS, Android, Android TV.


💡 Поддержка 24/7:

Обращайтесь, если потребуется помощь.
`})
}