export async function vpnMessage(bot, chatId){
    return await bot.sendPhoto(chatId, "./assets/db/images/IMG_5181.JPG", {caption: `🛡 Что такое VPN NXSTORE?

VPN NXSTORE — это современный VPN-сервис, разработанный для тех, кто ценит скорость, безопасность и удобство.

🔒 Безопасность данных
Полная анонимность. Мы ничего не храним и не отслеживаем.

⚡ Скорость и стабильность
Надёжное подключение без лагов и перебоев — всегда на высокой скорости.

🧠 Собственные технологии
Мы используем современный протокол VLESS, обеспечивающий максимальную защиту и производительность.

📱 Поддержка всех устройств
Совместим с Windows, macOS, iOS, Android, Android TV.

💡 Поддержка 24/7
Возникли вопросы? Мы всегда на связи — пиши в любое время.


`, reply_markup: {
    inline_keyboard: [
        [{text: "Назад", callback_data: "main"}]
    ]
}})
}